      ********************************
      *** Author:  Reymon Dev      ***
      *** File:    db.cbl          ***
      *** Date:    18/03/2026      ***
      *** Update:  20/03/2026      ***
      *** License: AGPL-3-or-later ***
      ********************************

      *************************
      *** Logic of the file ***
      *************************

       FD FC-REYMON-DATABASE.
       01 FS-PRIMARY-KEY PIC 9(18) COMP.
       01 FS-BUFFER      PIC X(4088).
