      ********************************
      *** Author:  Reymon Dev      ***
      *** File:    reydb.cpy       ***
      *** Date:    20/03/2026      ***
      *** Update:  20/03/2026      ***
      *** License: AGPL-3-or-later ***
      ********************************
       
       01 WS-REYMON-DATABASE.
          02 WS-PRIMARY-KEY PIC 9(18)   VALUE ZERO COMP-5.
          02 WS-BUFFER      PIC X(4088) VALUE SPACE.