      ********************************
      *** Author:  Reymon Dev      ***
      *** File:    reydb.cpy       ***
      *** Date:    20/03/2026      ***
      *** Update:  20/03/2026      ***
      *** License: AGPL-3-or-later ***
      ********************************
       
       01 WS-REYDB.
          02 WS-REYDB-PRIMARY-KEY PIC X(18)   VALUE SPACE.
          02 WS-REYDB-BUFFER      PIC X(4088) VALUE SPACE.