      ********************************
      *** Author:  Reymon Dev      ***
      *** File:    exist.cbl       ***
      *** Date:    18/03/2026      ***
      *** Update:  30/03/2026      ***
      *** License: AGPL-3-or-later ***
      ********************************

      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. REYDB_COUNTER.
       AUTHOR. Reymon Dev.
       DATE-WRITTEN.  April 16 from 2026.
       DATE-COMPILED. April 16 from 2026.
      ******************************************************************

      ******************************************************************
       ENVIRONMENT DIVISION.
      ******************************************************************

      ******************************************************************
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       COPY "file/control/reydb.cpy".
      ******************************************************************

      ******************************************************************
       DATA DIVISION.
      ******************************************************************

      ******************************************************************
       FILE SECTION.

       COPY "file/section/reydb.cpy".
      ******************************************************************

      ******************************************************************
       WORKING-STORAGE SECTION.

       77 WS-COUNTER PIC 9(18) VALUE ZERO.

       COPY "data/working/reydb.cpy".
      ******************************************************************

      ******************************************************************
       LINKAGE SECTION.

       COPY "data/linkage/reydb.cpy".
      ******************************************************************

      ******************************************************************
       PROCEDURE DIVISION RETURNING LS-REYDB-RESULT.
      ******************************************************************
      
      ******************************************************************
       INIT-PROGRAM.
           OPEN I-O FC-REYDB.
      ******************************************************************

      ******************************************************************
       LOGIC-PROGRAM.
           READ FC-REYDB INTO WS-COUNTER
       
           INVALID KEY

           ADD 1 TO WS-COUNTER
           MOVE WS-COUNTER TO LS-REYDB-RESULT
       
           END-READ.
      ******************************************************************

      ******************************************************************
       END-PROGRAM.
           CLOSE FC-REYDB.
           GOBACK.
      ******************************************************************