      ********************************
      *** Author:  Reymon Dev      ***
      *** File:    rdb.cpy         ***
      *** Date:    20/03/2026      ***
      *** Update:  20/03/2026      ***
      *** License: AGPL-3-or-later ***
      ********************************

       77 LS-REYDB-NAME   PIC X(064).
       77 LS-REYDB-TABLE  PIC X(256).
       77 LS-REYDB-RESULT PIC S9(9) COMP-5.