      *********************************
      *** Author:  Reymon Dev       ***
      *** File:    file-control.cbl ***
      *** Date:    20/03/2026       ***
      *** Update:  20/03/2026       ***
      *** License: AGPL-3-or-later  ***
      *********************************

       77 LS-REYMON-DATABASE-NAME   PIC 9(18) COMP.
       77 LS-REYMON-DATABASE-FILE-STATUS PIC X(02).
