      ********************************
      *** Author:  Reymon Dev      ***
      *** File:    reydb.cpy       ***
      *** Date:    20/03/2026      ***
      *** Update:  20/03/2026      ***
      *** License: AGPL-3-or-later ***
      ********************************

       77 LS-REYMON-DATABASE-NAME   PIC X(256).
       77 LS-REYMON-DATABASE-RESULT PIC S9(09) COMP-5.