      ********************************
      *** Author:  Reymon Dev      ***
      *** File:    add.cbl         ***
      *** Date:    18/03/2026      ***
      *** Update:  18/03/2026      ***
      *** License: AGPL-3-or-later ***
      ********************************

      ***************************************
      *** Division for set configurations ***
      ***       of the program            ***
      ***************************************

       IDENTIFICATION DIVISION.
       PROGRAM-ID. rdb_add.
