      ********************************
      *** Author:  Reymon Dev      ***
      *** File:    add.cbl         ***
      *** Date:    18/03/2026      ***
      *** Update:  24/03/2026      ***
      *** License: AGPL-3-or-later ***
      ********************************

      ***************************************
      *** Division for set configurations ***
      ***       of the program            ***
      ***************************************

      ************************************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. REYDB_ADD.
       AUTHOR. Reymon Dev.
       DATE-WRITTEN.  March 18 from 2026.
       DATE-COMPILED. March 24 from 2026.
      ************************************************************************************

      ************************************************************************************
       ENVIRONMENT DIVISION.
      ************************************************************************************

      ************************************************************************************
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       
       COPY "file/control/reydb.cpy".
      ************************************************************************************

      ************************************************************************************
       DATA DIVISION.
      ************************************************************************************

      ************************************************************************************
       FILE SECTION.
       
       COPY "file/section/reydb.cpy".
      ************************************************************************************

      ************************************************************************************
       WORKING-STORAGE SECTION.

       COPY "data/working/state.cpy".
      ************************************************************************************

      ************************************************************************************
       LINKAGE SECTION.
       
       COPY "data/linkage/reydb.cpy".
      ************************************************************************************

      ************************************************************************************
       PROCEDURE DIVISION USING     LS-REYDB-REGISTER
                          RETURNING LS-REYDB-RESULT.
      ************************************************************************************

      ************************************************************************************
       START-PROGRAM.

           PERFORM SET-INFO.
           PERFORM OPEN-FILE.
           PERFORM WRITE-FILE.
           PERFORM CLOSE-FILE.
           PERFORM RESULT.

           GOBACK.
      ************************************************************************************

      ************************************************************************************
       SET-INFO.
           MOVE LS-REYDB-REGISTER TO FS-REYDB-BUFFER.
      ************************************************************************************

      ************************************************************************************
       OPEN-FILE.
           OPEN I-O FS-REYDB.
      ************************************************************************************

      ************************************************************************************
       CLOSE-FILE.
           CLOSE FS-REYDB.
      ************************************************************************************

      ************************************************************************************
       RESULT.
           MOVE WS-REYDB-SUCCESS TO LS-REYDB-RESULT.
      ************************************************************************************

      ************************************************************************************
       WRITE-FILE.
           WRITE FS-REYDB-PRIMARY-KEY.
           WRITE FS-REYDB-BUFFER.
      ************************************************************************************