      ********************************
      *** Author:  Reymon Dev      ***
      *** File:    add.cbl         ***
      *** Date:    18/03/2026      ***
      *** Update:  24/03/2026      ***
      *** License: AGPL-3-or-later ***
      ********************************

      ***************************************
      *** Division for set configurations ***
      ***       of the program            ***
      ***************************************

      ************************************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. REYDB_ADD.
       AUTHOR. Reymon Dev.
       DATE-WRITTEN.  March 18 from 2026.
       DATE-COMPILED. March 24 from 2026.
      ************************************************************************************

      ************************************************************************************
       ENVIRONMENT DIVISION.
      ************************************************************************************

      ************************************************************************************
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       
       COPY "file/control/reydb.cpy".
      ************************************************************************************

      ************************************************************************************
       DATA DIVISION.
      ************************************************************************************

      ************************************************************************************
       FILE SECTION.
       
       COPY "file/section/reydb.cpy".
      ************************************************************************************

      ************************************************************************************
       LINKAGE SECTION.
       
       COPY "data/linkage/add.cpy".
       COPY "data/linkage/reydb.cpy".
      ************************************************************************************

      ************************************************************************************
       PROCEDURE DIVISION RETURNING LS-REYDB-RESULT.

           GOBACK.
      ************************************************************************************